# -*- coding: utf-8 -*-
module BacklogApi
  class Command < Thor

    
    ##################################################################################
    # サブコマンドの説明
    ##################################################################################
    desc "get_timeline", "タイムラインを取得するよ"




    ##################################################################################
    # オプション
    ##################################################################################
    






    ##################################################################################
    # サブコマンド定義
    ##################################################################################
    # まとめて定義
    # 例: $ backlog get_timeline
    API_METHODS.map(&:underscore).each do |api_method|

      # オプション
      method_option( :from,
        type: :string,
        desc: "説明だよ",	
        dequired: false,
        default: "a",
        aliases: "-f"
        )

      # サブコマンド定義
      define_method api_method do 
        Backlog::Client.new.send api_method
      end
    end
    
    def hello(name="a")
      puts "Hello #{name}"
    end
    
  end
end
